; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-22)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 5 of 22
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 5 of 22
3. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 5 of 22
4. (drop ball8 room4 right)
   deleted: (carry ball8 right)
   added: (at ball8 room4) (free right)
   goals met: 6 of 22
5. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 7 of 22
6. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 7 of 22
7. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 7 of 22
8. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 7 of 22
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 7 of 22
10. (drop ball11 room4 right)
   deleted: (carry ball11 right)
   added: (at ball11 room4) (free right)
   goals met: 8 of 22
11. (drop ball12 room4 left)
   deleted: (carry ball12 left)
   added: (at ball12 room4) (free left)
   goals met: 9 of 22
12. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 9 of 22
13. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 9 of 22
14. (pick ball16 room3 right)
   deleted: (at ball16 room3) (free right)
   added: (carry ball16 right)
   goals met: 9 of 22
15. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 9 of 22
16. (drop ball16 room4 right)
   deleted: (carry ball16 right)
   added: (at ball16 room4) (free right)
   goals met: 10 of 22
17. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 11 of 22
18. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 11 of 22
19. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 11 of 22
20. (pick ball14 room3 right)
   deleted: (at ball14 room3) (free right)
   added: (carry ball14 right)
   goals met: 11 of 22
21. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 11 of 22
22. (drop ball14 room4 right)
   deleted: (carry ball14 right)
   added: (at ball14 room4) (free right)
   goals met: 12 of 22
23. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 13 of 22
24. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 13 of 22
25. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 13 of 22
26. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 13 of 22
27. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 14 of 22
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 22
29. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 14 of 22
30. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 14 of 22
31. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 14 of 22
32. (drop ball6 room4 right)
   deleted: (carry ball6 right)
   added: (at ball6 room4) (free right)
   goals met: 15 of 22
33. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 16 of 22
34. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 22
35. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 16 of 22
36. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 16 of 22
37. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 22
38. (drop ball4 room4 right)
   deleted: (carry ball4 right)
   added: (at ball4 room4) (free right)
   goals met: 17 of 22
39. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 18 of 22
40. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 22
41. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 18 of 22
42. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 18 of 22
43. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 22
44. (drop ball2 room4 right)
   deleted: (carry ball2 right)
   added: (at ball2 room4) (free right)
   goals met: 19 of 22
45. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 20 of 22
46. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 20 of 22
47. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 20 of 22
48. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 20 of 22
49. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 22
50. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 21 of 22
51. (drop ball1 room4 right)
   deleted: (carry ball1 right)
   added: (at ball1 room4) (free right)
   goals met: 22 of 22
